eisup_2019_docmng_integration/src/Documents/zsttk_ИзменениеРаспределенияВыручкиЗаказовПоРегионам/zsttk_ИзменениеРаспределенияВыручкиЗаказовПоРегионам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>zsttk_ИзменениеРаспределенияВыручкиЗаказовПоРегионам</name>
  <registerRecords>InformationRegister.zsttk_РаспределениеВыручкиЗаказаПоРегионам</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СегментыСети</name>
    <attributes>
      <name>СегментСети</name>
      <type>
        <types>CatalogRef.СегментыСети</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Documents/zsttk_ИзменениеРаспределенияВыручкиЗаказовПоРегионам/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Итого = 0;
	Для Каждого ТекСтрокаСегментыСети Из СегментыСети Цикл
		Итого = Итого + ТекСтрокаСегментыСети.Процент;
	КонецЦикла;
	
	Если Итого <> 100 Тогда
		Отказ = Истина;
		сообщить("Общий процент не равен 100%");
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрокаСегментыСети Из СегментыСети Цикл
		// регистр РаспределениеВыручкиЗаказаПоРегионам 
		Движение = Движения.РаспределениеВыручкиЗаказаПоРегионам.Добавить();
		Движение.Период = Дата;
		Движение.Заказ = Заказ;
		Движение.СегментСети = ТекСтрокаСегментыСети.СегментСети;
		Движение.Процент = ТекСтрокаСегментыСети.Процент;
	КонецЦикла;
	// записываем движения регистров
	Движения.РаспределениеВыручкиЗаказаПоРегионам.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
